name: "infer"
backend: "python"
max_batch_size : 0
input [
  {
    name: "input"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]
output [
  {
    name: "output"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]
instance_group [
  {
    kind: KIND_CPU
  }
]