name: "predict"
platform: "ensemble"
max_batch_size : 0
input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]
output [
  {
    name: "pred"
    data_type: TYPE_STRING
    dims: [ -1 ]
  },
  {
    name: "score"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "tokenize"
      model_version: -1
      input_map {
        key: "text"
        value: "text"
      }
      output_map [
        {
          key: "input_ids"
          value: "input_ids"
        },
        {
          key: "attention_mask"
          value: "attention_mask"
        },
        {
          key: "token_type_ids"
          value: "token_type_ids"
        }
      ]
    },
    {
      model_name: "pred-onnx"
      model_version: -1
      input_map [
        {
          key: "input_ids"
          value: "input_ids"
        },
        {
          key: "attention_mask"
          value: "attention_mask"
        },
        {
          key: "token_type_ids"
          value: "token_type_ids"
        }
      ]
      output_map {
        key: "output_0"
        value: "input_0"
      }
    },
    {
      model_name: "postproc"
      model_version: -1
      input_map {
        key: "input_0"
        value: "input_0"
      }
      output_map [
        {
          key: "pred"
          value: "pred"
        },
        {
          key: "score"
          value: "score"
        }
      ]
    }
  ]
}