name: "word"
backend: "python"
max_batch_size : 0
input [
  {
    name: "text"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]
output [
  {
    name: "word_text"
    data_type: TYPE_STRING
    dims: [ -1 ]
  },
  {
    name: "word_offset"
    data_type: TYPE_INT32
    dims: [ -1 ]
  },
  {
    name: "word_length"
    data_type: TYPE_INT32
    dims: [ -1 ]
  },
  {
    name: "word_index"
    data_type: TYPE_INT32
    dims: [ -1 ]
  },
  {
    name: "group_index"
    data_type: TYPE_INT32
    dims: [ -1 ]
  }
]
instance_group [
  {
    kind: KIND_CPU
  }
]